Revit 2026 API

# AssetPropertyUInt64Value Property

---

Get the value of the property.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ulong Value { get; }
```
```vb
Public ReadOnly Property Value As ULong
	Get
```
```cpp
public:
property unsigned long long Value {
	unsigned long long get ();
}
```
```fsharp
member Value : uint64 with get
```

#### Property Value

UInt64

#### Reference

AssetPropertyUInt64 Class

Autodesk.Revit.DB.Visual Namespace